dany994/vak-opensource/microcontrollers/pic32sim/mz.c
    /*-------------------------------------------------------------------------
     * System controller.
     */
    STORAGE (OSCCON); break;	// Oscillator Control
    STORAGE (OSCTUN); break;	// Oscillator Tuning
    READONLY(DEVID);		// Device Identifier
    STORAGE (SYSKEY);		// System Key
	/* Unlock state machine. */
	if (syskey_unlock == 0 && VALUE(SYSKEY) == 0xaa996655)
	    syskey_unlock = 1;
	if (syskey_unlock == 1 && VALUE(SYSKEY) == 0x556699aa)
	    syskey_unlock = 2;
	else
	    syskey_unlock = 0;
	break;
    STORAGE (RCON); break;	// Reset Control
    STORAGE (RSWRST);		// Software Reset
	if (syskey_unlock == 2 && (VALUE(RSWRST) & 1)) {
            /* Reset CPU. */
            soft_reset();

            /* Reset all devices */
            io_reset();
            sdcard_reset();
        }
	break;

    /*-------------------------------------------------------------------------
     * General purpose IO signals.
     */
    WRITEOP (TRISA); return;	    // Port A: mask of inputs
    WRITEOPX(PORTA, LATA);          // Port A: write outputs
    WRITEOP (LATA);                 // Port A: write outputs
        gpio_write (0, VALUE(LATA));
	return;
    WRITEOP (ODCA); return;	    // Port A: open drain configuration
    WRITEOP (CNPUA); return;	    // Input pin pull-up 
    WRITEOP (CNPDA); return;	    // Input pin pull-down 
    WRITEOP (CNCONA); return;	    // Interrupt-on-change control
    WRITEOP (CNENA); return;	    // Input change interrupt enable
    WRITEOP (CNSTATA); return;	    // Input change status

    WRITEOP (TRISB); return;	    // Port B: mask of inputs
    WRITEOPX(PORTB, LATB);          // Port B: write outputs
    WRITEOP (LATB);		    // Port B: write outputs
        gpio_write (1, VALUE(LATB));
	return;
    WRITEOP (ODCB); return;	    // Port B: open drain configuration
    WRITEOP (CNPUB); return;	    // Input pin pull-up 
    WRITEOP (CNPDB); return;	    // Input pin pull-down 
    WRITEOP (CNCONB); return;	    // Interrupt-on-change control
    WRITEOP (CNENB); return;	    // Input change interrupt enable
    WRITEOP (CNSTATB); return;	    // Input change status

    WRITEOP (TRISC); return;	    // Port C: mask of inputs
    WRITEOPX(PORTC, LATC);          // Port C: write outputs
    WRITEOP (LATC);                 // Port C: write outputs
        gpio_write (2, VALUE(LATC));
	return;
    WRITEOP (ODCC); return;	    // Port C: open drain configuration
    WRITEOP (CNPUC); return;	    // Input pin pull-up 
    WRITEOP (CNPDC); return;	    // Input pin pull-down 
    WRITEOP (CNCONC); return;	    // Interrupt-on-change control
    WRITEOP (CNENC); return;	    // Input change interrupt enable
    WRITEOP (CNSTATC); return;	    // Input change status

    WRITEOP (TRISD); return;	    // Port D: mask of inputs
    WRITEOPX(PORTD, LATD);          // Port D: write outputs
    WRITEOP (LATD);		    // Port D: write outputs
        gpio_write (3, VALUE(LATD));
	return;
    WRITEOP (ODCD); return;	    // Port D: open drain configuration
    WRITEOP (CNPUD); return;	    // Input pin pull-up 
    WRITEOP (CNPDD); return;	    // Input pin pull-down 
    WRITEOP (CNCOND); return;	    // Interrupt-on-change control
    WRITEOP (CNEND); return;	    // Input change interrupt enable
    WRITEOP (CNSTATD); return;	    // Input change status

    WRITEOP (TRISE); return;	    // Port E: mask of inputs
    WRITEOPX(PORTE, LATE);          // Port E: write outputs
    WRITEOP (LATE);		    // Port E: write outputs
        gpio_write (4, VALUE(LATE));
	return;
    WRITEOP (ODCE); return;	    // Port E: open drain configuration
    WRITEOP (CNPUE); return;	    // Input pin pull-up 
    WRITEOP (CNPDE); return;	    // Input pin pull-down 
    WRITEOP (CNCONE); return;	    // Interrupt-on-change control
    WRITEOP (CNENE); return;	    // Input change interrupt enable
    WRITEOP (CNSTATE); return;	    // Input change status

    WRITEOP (TRISF); return;	    // Port F: mask of inputs
    WRITEOPX(PORTF, LATF);          // Port F: write outputs
    WRITEOP (LATF);		    // Port F: write outputs
        gpio_write (5, VALUE(LATF));
	return;
    WRITEOP (ODCF); return;	    // Port F: open drain configuration
    WRITEOP (CNPUF); return;	    // Input pin pull-up 
    WRITEOP (CNPDF); return;	    // Input pin pull-down 
    WRITEOP (CNCONF); return;	    // Interrupt-on-change control
    WRITEOP (CNENF); return;	    // Input change interrupt enable
    WRITEOP (CNSTATF); return;	    // Input change status

    WRITEOP (TRISG); return;	    // Port G: mask of inputs
    WRITEOPX(PORTG, LATG);          // Port G: write outputs
    WRITEOP (LATG);		    // Port G: write outputs
        gpio_write (6, VALUE(LATG));
	return;
    WRITEOP (ODCG); return;	    // Port G: open drain configuration
    WRITEOP (CNPUG); return;	    // Input pin pull-up 
    WRITEOP (CNPDG); return;	    // Input pin pull-down 
    WRITEOP (CNCONG); return;	    // Interrupt-on-change control
    WRITEOP (CNENG); return;	    // Input change interrupt enable
    WRITEOP (CNSTATG); return;	    // Input change status

    /*-------------------------------------------------------------------------
     * UART 1.
     */
    STORAGE (U1TXREG);                              // Transmit
        uart_put_char (0, data);
        break;
    WRITEOP (U1MODE);                               // Mode
        uart_update_mode (0);
        return;
    WRITEOPR (U1STA,                                // Status and control
        PIC32_USTA_URXDA | PIC32_USTA_FERR | PIC32_USTA_PERR |
        PIC32_USTA_RIDLE | PIC32_USTA_TRMT | PIC32_USTA_UTXBF);
        uart_update_status (0);
        return;
    WRITEOP (U1BRG); return;                        // Baud rate
    READONLY (U1RXREG);                             // Receive

    /*-------------------------------------------------------------------------
     * UART 2.
     */
    STORAGE (U2TXREG);                              // Transmit
        uart_put_char (1, data);
        break;
    WRITEOP (U2MODE);                               // Mode
        uart_update_mode (1);
        return;
    WRITEOPR (U2STA,                                // Status and control
        PIC32_USTA_URXDA | PIC32_USTA_FERR | PIC32_USTA_PERR |
        PIC32_USTA_RIDLE | PIC32_USTA_TRMT | PIC32_USTA_UTXBF);
        uart_update_status (1);
        return;
    WRITEOP (U2BRG); return;                        // Baud rate
    READONLY (U2RXREG);                             // Receive

    /*-------------------------------------------------------------------------
     * UART 3.
     */
    STORAGE (U3TXREG);                              // Transmit
        uart_put_char (2, data);
        break;
    WRITEOP (U3MODE);                               // Mode
        uart_update_mode (2);
        return;
    WRITEOPR (U3STA,                                // Status and control
        PIC32_USTA_URXDA | PIC32_USTA_FERR | PIC32_USTA_PERR |
        PIC32_USTA_RIDLE | PIC32_USTA_TRMT | PIC32_USTA_UTXBF);
        uart_update_status (2);
        return;
    WRITEOP (U3BRG); return;                        // Baud rate
    READONLY (U3RXREG);                             // Receive

    /*-------------------------------------------------------------------------
     * UART 4.
     */
    STORAGE (U4TXREG);                              // Transmit
        uart_put_char (3, data);
        break;
    WRITEOP (U4MODE);                               // Mode
        uart_update_mode (3);
        return;
    WRITEOPR (U4STA,                                // Status and control
        PIC32_USTA_URXDA | PIC32_USTA_FERR | PIC32_USTA_PERR |
        PIC32_USTA_RIDLE | PIC32_USTA_TRMT | PIC32_USTA_UTXBF);
        uart_update_status (3);
        return;
    WRITEOP (U4BRG); return;                        // Baud rate
    READONLY (U4RXREG);                             // Receive

    /*-------------------------------------------------------------------------
     * UART 5.
     */
    STORAGE (U5TXREG);                              // Transmit
        uart_put_char (4, data);
        break;
    WRITEOP (U5MODE);                               // Mode
        uart_update_mode (4);
        return;
    WRITEOPR (U5STA,                                // Status and control
        PIC32_USTA_URXDA | PIC32_USTA_FERR | PIC32_USTA_PERR |
        PIC32_USTA_RIDLE | PIC32_USTA_TRMT | PIC32_USTA_UTXBF);
        uart_update_status (4);
        return;
    WRITEOP (U5BRG); return;                        // Baud rate
    READONLY (U5RXREG);                             // Receive

    /*-------------------------------------------------------------------------
     * UART 6.
     */
    STORAGE (U6TXREG);                              // Transmit
        uart_put_char (5, data);
        break;
    WRITEOP (U6MODE);                               // Mode
        uart_update_mode (5);
        return;
    WRITEOPR (U6STA,                                // Status and control
        PIC32_USTA_URXDA | PIC32_USTA_FERR | PIC32_USTA_PERR |
        PIC32_USTA_RIDLE | PIC32_USTA_TRMT | PIC32_USTA_UTXBF);
        uart_update_status (5);
        return;
    WRITEOP (U6BRG); return;                        // Baud rate
    READONLY (U6RXREG);                             // Receive

    /*-------------------------------------------------------------------------
     * SPI.
     */
    WRITEOP (SPI1CON);                              // Control
	spi_control (0);
        return;
    WRITEOPR (SPI1STAT, ~PIC32_SPISTAT_SPIROV);     // Status
        return;                                     // Only ROV bit is writable
    STORAGE (SPI1BUF);                              // Buffer
        spi_writebuf (0, data);
        return;
    WRITEOP (SPI1BRG); return;                      // Baud rate
    WRITEOP (SPI1CON2); return;                     // Control 2

    WRITEOP (SPI2CON);                              // Control
	spi_control (1);
        return;
    WRITEOPR (SPI2STAT, ~PIC32_SPISTAT_SPIROV);     // Status
        return;                                     // Only ROV bit is writable
    STORAGE (SPI2BUF);                              // Buffer
        spi_writebuf (1, data);
        return;
    WRITEOP (SPI2BRG); return;                      // Baud rate
    WRITEOP (SPI2CON2); return;                     // Control 2

