dany994/vak-opensource/microcontrollers/pic32sim/mz.c
    WRITEOP (SPI3CON);                              // Control
	spi_control (2);
        return;
    WRITEOPR (SPI3STAT, ~PIC32_SPISTAT_SPIROV);     // Status
        return;                                     // Only ROV bit is writable
    STORAGE (SPI3BUF);                              // Buffer
        spi_writebuf (2, data);
        return;
    WRITEOP (SPI3BRG); return;                      // Baud rate
    WRITEOP (SPI3CON2); return;                     // Control 2

    WRITEOP (SPI4CON);                              // Control
	spi_control (3);
        return;
    WRITEOPR (SPI4STAT, ~PIC32_SPISTAT_SPIROV);     // Status
        return;                                     // Only ROV bit is writable
    STORAGE (SPI4BUF);                              // Buffer
        spi_writebuf (3, data);
        return;
    WRITEOP (SPI4BRG); return;      // Baud rate
    WRITEOP (SPI4CON2); return;                     // Control 2

    default:
        fprintf (stderr, "--- Write %08x to %08x: peripheral register not supported\n",
            data, address);
        exit (1);
readonly:
        fprintf (stderr, "--- Write %08x to %s: readonly register\n",
            data, *namep);
        *namep = 0;
        return;
    }
    *bufp = data;
}

void io_reset()
{
    /*
     * Prefetch controller.
     */
    VALUE(PRECON) = 0x00000007;

    /*
     * System controller.
     */
    VALUE(OSCCON) = 0x01453320;         // from ubw32 board
    VALUE(OSCTUN) = 0;
    VALUE(DEVID)  = 0x04307053;         // 795F512L
    VALUE(SYSKEY) = 0;
    VALUE(RCON)   = 0;
    VALUE(RSWRST) = 0;
    syskey_unlock  = 0;

    /*
     * General purpose IO signals.
     * All pins are inputs, high, open drains and pullups disabled.
     * No interrupts on change.
     */
    VALUE(TRISA) = 0xFFFF;		// Port A: mask of inputs
    VALUE(PORTA) = 0xFFFF;		// Port A: read inputs, write outputs
    VALUE(LATA)  = 0xFFFF;		// Port A: read/write outputs
    VALUE(ODCA)  = 0;			// Port A: open drain configuration
    VALUE(CNPUA) = 0;			// Input pin pull-up 
    VALUE(CNPDA) = 0;			// Input pin pull-down 
    VALUE(CNCONA) = 0;			// Interrupt-on-change control
    VALUE(CNENA) = 0;			// Input change interrupt enable
    VALUE(CNSTATA) = 0;			// Input change status

    VALUE(TRISB) = 0xFFFF;		// Port B: mask of inputs
    VALUE(PORTB) = 0xFFFF;		// Port B: read inputs, write outputs
    VALUE(LATB)  = 0xFFFF;		// Port B: read/write outputs
    VALUE(ODCB)  = 0;			// Port B: open drain configuration
    VALUE(CNPUB) = 0;			// Input pin pull-up 
    VALUE(CNPDB) = 0;			// Input pin pull-down 
    VALUE(CNCONB) = 0;			// Interrupt-on-change control
    VALUE(CNENB) = 0;			// Input change interrupt enable
    VALUE(CNSTATB) = 0;			// Input change status

    VALUE(TRISC) = 0xFFFF;		// Port C: mask of inputs
    VALUE(PORTC) = 0xFFFF;		// Port C: read inputs, write outputs
    VALUE(LATC)  = 0xFFFF;		// Port C: read/write outputs
    VALUE(ODCC)  = 0;			// Port C: open drain configuration
    VALUE(CNPUC) = 0;			// Input pin pull-up 
    VALUE(CNPDC) = 0;			// Input pin pull-down 
    VALUE(CNCONC) = 0;			// Interrupt-on-change control
    VALUE(CNENC) = 0;			// Input change interrupt enable
    VALUE(CNSTATC) = 0;			// Input change status

    VALUE(TRISD) = 0xFFFF;		// Port D: mask of inputs
    VALUE(PORTD) = 0xFFFF;		// Port D: read inputs, write outputs
    VALUE(LATD)  = 0xFFFF;		// Port D: read/write outputs
    VALUE(ODCD)  = 0;			// Port D: open drain configuration
    VALUE(CNPUD) = 0;			// Input pin pull-up 
    VALUE(CNPDD) = 0;			// Input pin pull-down 
    VALUE(CNCOND) = 0;			// Interrupt-on-change control
    VALUE(CNEND) = 0;			// Input change interrupt enable
    VALUE(CNSTATD) = 0;			// Input change status

    VALUE(TRISE) = 0xFFFF;		// Port E: mask of inputs
    VALUE(PORTE) = 0xFFFF;		// Port D: read inputs, write outputs
    VALUE(LATE)  = 0xFFFF;		// Port E: read/write outputs
    VALUE(ODCE)  = 0;			// Port E: open drain configuration
    VALUE(CNPUE) = 0;			// Input pin pull-up 
    VALUE(CNPDE) = 0;			// Input pin pull-down 
    VALUE(CNCONE) = 0;			// Interrupt-on-change control
    VALUE(CNENE) = 0;			// Input change interrupt enable
    VALUE(CNSTATE) = 0;			// Input change status

    VALUE(TRISF) = 0xFFFF;		// Port F: mask of inputs
    VALUE(PORTF) = 0xFFFF;		// Port F: read inputs, write outputs
    VALUE(LATF)  = 0xFFFF;		// Port F: read/write outputs
    VALUE(ODCF)  = 0;			// Port F: open drain configuration
    VALUE(CNPUF) = 0;			// Input pin pull-up 
    VALUE(CNPDF) = 0;			// Input pin pull-down 
    VALUE(CNCONF) = 0;			// Interrupt-on-change control
    VALUE(CNENF) = 0;			// Input change interrupt enable
    VALUE(CNSTATF) = 0;			// Input change status

    VALUE(TRISG) = 0xFFFF;		// Port G: mask of inputs
    VALUE(PORTG) = 0xFFFF;		// Port G: read inputs, write outputs
    VALUE(LATG)  = 0xFFFF;		// Port G: read/write outputs
    VALUE(ODCG)  = 0;			// Port G: open drain configuration
    VALUE(CNPUG) = 0;			// Input pin pull-up 
    VALUE(CNPDG) = 0;			// Input pin pull-down 
    VALUE(CNCONG) = 0;			// Interrupt-on-change control
    VALUE(CNENG) = 0;			// Input change interrupt enable
    VALUE(CNSTATG) = 0;			// Input change status

    uart_reset();
    spi_reset();
}

void io_init (void *bootp)
{
    bootmem = bootp;

    // Preset DEVCFG data, from Max32 bootloader.
    BOOTMEM(DEVCFG3) = 0xffff0722;
    BOOTMEM(DEVCFG2) = 0xd979f8f9;
    BOOTMEM(DEVCFG1) = 0x5bfd6aff;
    BOOTMEM(DEVCFG0) = 0xffffff7f;

    io_reset();
    sdcard_reset();
}
